tutorials/fluidSolidInteraction/mokLidDrivenCavity/0/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

// The lid velocity is vBar = 1 - cos(2 pi t/5) m/s. The inlet profile rises
// linearly from zero at the bottom of the opening (y = 0.875) to vBar at the
// lid (y = 1), i.e. vBar*(8 y - 7). Both are imposed with codedFixedValue,
// which OpenFOAM.com and OpenFOAM.org provide but foam-extend does not
boundaryField
{
    lid
    {
        type            codedFixedValue;
        value           uniform (0 0 0);
        name            mokCavityLidVelocity;

        code
        #{
            const scalar t = this->db().time().value();
            const scalar vBar = 1.0 - Foam::cos(2.0*3.14159265358979*t/5.0);

            operator==(vector(vBar, 0, 0));
        #};
    }
    inlet
    {
        type            codedFixedValue;
        value           uniform (0 0 0);
        name            mokCavityInletVelocity;

        code
        #{
            const scalar t = this->db().time().value();
            const scalar vBar = 1.0 - Foam::cos(2.0*3.14159265358979*t/5.0);
            const scalarField y(this->patch().Cf().component(vector::Y));

            operator==(vBar*(8.0*y - 7.0)*vector(1, 0, 0));
        #};
    }
    outlet
    {
        type            zeroGradient;
    }
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    interface
    {
        type            newMovingWallVelocity;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
