tutorials/fluidSolidInteraction/mokLidDrivenCavity/constant/fluid/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh dynamicMotionSolverFvMesh;

"solver|motionSolver" velocityLaplacian;

// The membrane rises by about a quarter of the cavity height. A uniform
// diffusivity spreads the resulting compression over the whole cavity: with an
// inverse-distance diffusivity it concentrates in the cells below the fixed
// openings and lid, which then collapse after about 14 s
diffusivity uniform;

// ************************************************************************* //
