tutorials/fluidSolidInteraction/mokLidDrivenCavity/constant/fsiProperties
fsiProperties.iqnils