tutorials/fluidSolidInteraction/mokLidDrivenCavity/constant/fsiProperties.iqnils
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fsiProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//fluidSolidInterface    fixedRelaxation;
//fluidSolidInterface    Aitken;
fluidSolidInterface    IQNILS;

"fixedRelaxationCoeffs|AitkenCoeffs|IQNILSCoeffs"
{
    // Interface patches
    solidPatch interface;
    fluidPatch interface;

    // Predictors at the start of a new time step
    predictor            yes;
    predictSolid         yes;

    // Under-relaxation factor for passing the solid interface
    // displacement/velocity to the fluid interface
    // For fixedRelaxation, this value is used for all iterations
    // For Aitken, this value is used for the first iteration each time-step,
    // then it adaptively changes
    // For IQNILS, this value is used for the first two iterations each
    // time-step, then the IQNILS procedure is used
    relaxationFactor 0.1;

    // Tolerance for the FSI loop within each time-step
    outerCorrTolerance 1e-5;

    // Maximum number of outer FSI loop correctors within each time-step
    nOuterCorr 50;

    // Enable/disable coupling from the start
    coupled yes;

    // Method for transferring information between the interfaces
    interfaceTransferMethod directMap;

    // Optional (only for IQNILS): re-use modes from previous time-steps.
    // The number of modes to be re-used is specified
    // Defaults to 0 modes
    couplingReuse 0;
    minSignificant 1e-12;
    // Optional: relative QR2-style filtering of older secant modes
    // relMinSignificant 1e-2;
    // Optional: normalize secant columns before the IQN-ILS QR solve
    // normalizeCouplingColumns yes;
    // Optional: reuse the previous time step's secants only in iteration 1
    // reusePreviousStepModes yes;
    // Optional: cap the reused iteration-1 IQN correction relative to |r|
    // maxReuseUpdateNormRatio 0.5;
    // Optional: assemble one aligned LS system across all interfaces
    // combinedCouplingSystem yes;
    // Optional: relative cutoff for the QR back-substitution
    // qrSolveTolerance 1e-10;
    // Optional: apply a second orthogonalization correction in the QR build
    // reorthogonalizeCouplingColumns yes;

    // Write fsi residuals to file
    writeResidualsToFile yes;
}

// ************************************************************************* //
