tutorials/fluidSolidInteraction/mokLidDrivenCavity/constant/solid/mechanicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      mechanicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// With nu = 0, plane stress and plane strain coincide
planeStress no;

mechanical
(
    membrane
    {
        type        StVenantKirchhoffElastic;
        rho         rho [1 -3 0 0 0 0 0] 500;
        E           E [1 -1 -2 0 0 0 0] 250;
        nu          nu [0 0 0 0 0 0 0] 0;
    }
);

// ************************************************************************* //
