tutorials/fluidSolidInteraction/mokLidDrivenCavity/system/solid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

d2dt2Schemes
{
    default                 backward;
}

ddtSchemes
{
    default                 backward;
}

gradSchemes
{
    default                 leastSquaresS4f;
}

divSchemes
{
    default                 Gauss linear;
}

laplacianSchemes
{
    default                 Gauss linear corrected;
}

snGradSchemes
{
    default                 corrected;
}

interpolationSchemes
{
    default                 linear;
}

// ************************************************************************* //
